# secure_folder_88/bruteforce.py
import random
import time

secret_pin = 4512 

print("--- ЗАПУСК ПЕРЕБОРА ПАРОЛЯ ---")
print("Цель: Найти PIN (от 0 до 9999)")

# ЗАДАНИЕ:
# Напишите цикл while, который будет подбирать пароль.
# 1. Генерируйте случайное число (random.randint)
# 2. Сравнивайте его с secret_pin
# 3. Если совпало - выводите на экран и останавливайте цикл (break)

# Ваш код здесь:
# ...

# После успешного взлома:
# print(f"ПАРОЛЬ НАЙДЕН: {found_pin}")
# Этот пароль откроет архив Level_3_Data.zip