'''
Задача 5: «Электронный дневник»
Задание: Вы пишете модуль для школьной системы. Учитель вводит имя ученика и через запятую перечисляет все его оценки за четверть. 
Ваша задача — написать функцию, которая считает средний балл.

ТЗ (Техническое задание):
- Напишите функцию calc_average.
- Первый аргумент (обязательный) — name (Имя ученика).
- Остальные аргументы — оценки (*grades).
- Функция должна вернуть строку: "Ученик [Имя]: Средний балл [Число]".
- Важно: Округлите средний балл до 1 знака после запятой (используйте round(число, 1)).
- Защита: Если оценок нет, верните фразу "Нет оценок".
'''